# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePointArray..::..ReverseIterator Method
ReferencePointArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ReferencePointArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ReferencePointArrayIterator
```

Visual C++
---
```text
public:
virtual ReferencePointArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace